sample-results-gemfire-colocated-3vm/output_gemfire_homelab_colocated_3vm_10000_5t_run.txt
/var/vcap/packages/jdk/bin/java  -classpath /root/workspace/YCSB-geode-custom/conf:/root/workspace/YCSB-geode-custom/core/target/core-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/geode-binding-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/LatencyUtils-2.0.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/antlr-2.7.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/awaitility-4.2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/bson-4.8.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/classgraph-4.8.154.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-beanutils-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-codec-1.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-collections-3.2.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-digester-2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-io-2.11.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-lang3-3.12.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-logging-1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-validator-1.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/fastutil-8.5.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-common-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-core-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-deployment-chained-classloader-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-logging-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-management-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-membership-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-serialization-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-messenger-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-server-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-unsafe-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-version-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/hamcrest-2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpclient-4.5.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpcore-4.4.16.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/istack-commons-runtime-4.0.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-annotations-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-core-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-databind-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-joda-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-jsr310-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.activation-api-1.2.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.resource-api-1.7.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.transaction-api-1.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-api-2.3.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-impl-2.3.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jgroups-3.6.14.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-platform-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/joda-time-2.10.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jopt-simple-5.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/log4j-api-2.19.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-commons-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-core-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-observation-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-buffer-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-codec-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-handler-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-resolver-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/rmiio-2.1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-cache-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-ogdl-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-cipher-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-hash-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-event-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-lang-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/slf4j-api-1.7.25.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-beans-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-core-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-jcl-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-web-5.3.34.jar site.ycsb.Client -t -db site.ycsb.db.GeodeClient -P ../workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
Command line: -t -db site.ycsb.db.GeodeClient -P ../workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
[INFO] core.Client recordcount:10000
[INFO] core.Client threadcount:5
[INFO] core.Client operationcount:10000
[INFO] core.Client readproportion:0.5
[INFO] core.Client updateproportion:0.5
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
ERROR StatusLogger Log4j2 could not find a logging implementation. Please add log4j-core to the classpath. Using SimpleLogger to log to the console...
2024-04-22 13:00:33:981 0 sec: 0 operations; est completion in 0 second 
[INFO] geode.Creating Cache
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
[INFO] geode.Created Cache: geode-client
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[INFO] core.ClientThread initialized: threadid: 3
[INFO] core.ClientThread initialized: threadid: 4
[INFO] core.ClientThread initialized: threadid: 0
[INFO] core.ClientThread initialized: threadid: 1
[INFO] core.ClientThread initialized: threadid: 2
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
2024-04-22 13:00:39:375 5 sec: 10000 operations; 1807.34 current ops/sec; [READ: Count=4960, Max=1326079, Min=182, Avg=2378.1, 90=1790, 99=7687, 99.9=67135, 99.99=1326079] [CLEANUP: Count=5, Max=2, Min=0, Avg=0.4, 90=2, 99=2, 99.9=2, 99.99=2] [UPDATE: Count=5040, Max=119167, Min=226, Avg=1331.63, 90=2151, 99=8831, 99.9=46111, 99.99=93951] 
[OVERALL], RunTime(ms), 5533
[OVERALL], Throughput(ops/sec), 1807.3377914332189
[TOTAL_GCS_G1_Young_Generation], Count, 9
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 86
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.5543105006325684
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 9
[TOTAL_GC_TIME], Time(ms), 86
[TOTAL_GC_TIME_%], Time(%), 1.5543105006325684
[READ], Operations, 4960
[READ], AverageLatency(us), 2378.0995967741937
[READ], MinLatency(us), 182
[READ], MaxLatency(us), 1326079
[READ], 95thPercentileLatency(us), 3139
[READ], 99thPercentileLatency(us), 7687
[READ], Return=OK, 4960
[CLEANUP], Operations, 5
[CLEANUP], AverageLatency(us), 0.4
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 2
[UPDATE], Operations, 5040
[UPDATE], AverageLatency(us), 1331.6313492063491
[UPDATE], MinLatency(us), 226
[UPDATE], MaxLatency(us), 119167
[UPDATE], 95thPercentileLatency(us), 3911
[UPDATE], 99thPercentileLatency(us), 8831
[UPDATE], Return=OK, 5040